CREATE TABLE `spawnlist_boss` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `location` varchar(45) NOT NULL DEFAULT '',
  `cycle_type` varchar(20) DEFAULT '',
  `weeks` varchar(255) DEFAULT NULL,
  `time` time DEFAULT NULL,
  `count` int(10) unsigned NOT NULL DEFAULT '0',
  `npc_id` int(10) unsigned NOT NULL DEFAULT '0',
  `group_id` int(10) unsigned NOT NULL DEFAULT '0',
  `locx` int(10) unsigned NOT NULL DEFAULT '0',
  `locy` int(10) unsigned NOT NULL DEFAULT '0',
  `randomx` int(10) unsigned NOT NULL DEFAULT '0',
  `randomy` int(10) unsigned NOT NULL DEFAULT '0',
  `locx1` int(10) unsigned NOT NULL DEFAULT '0',
  `locy1` int(10) unsigned NOT NULL DEFAULT '0',
  `locx2` int(10) unsigned NOT NULL DEFAULT '0',
  `locy2` int(10) unsigned NOT NULL DEFAULT '0',
  `heading` int(10) unsigned NOT NULL DEFAULT '0',
  `mapid` int(10) unsigned NOT NULL DEFAULT '0',
  `respawn_screen` tinyint(1) unsigned NOT NULL DEFAULT '0',
  `movement_distance` int(10) unsigned NOT NULL DEFAULT '0',
  `rest` tinyint(1) unsigned NOT NULL DEFAULT '0',
  `spawn_type` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `percentage` tinyint(3) unsigned NOT NULL DEFAULT '100',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=164 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of spawnlist_boss
-- ----------------------------
INSERT INTO `spawnlist_boss` VALUES ('11', '德雷克的靈魂', '10m', null, null, '1', '45458', '0', '32764', '32837', '0', '0', '0', '0', '0', '0', '5', '443', '0', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('17', '卡士柏', '30m', null, null, '1', '45488', '14', '32762', '32768', '0', '0', '32704', '32704', '32831', '32831', '0', '9', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('18', '庫曼', '10m', null, null, '1', '45492', '49', '32767', '32899', '0', '0', '32660', '32791', '32875', '33007', '0', '480', '0', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('19', '曼波兔', '10m', null, null, '1', '45534', '20', '32594', '33009', '0', '0', '32581', '32993', '32654', '33044', '0', '440', '1', '100', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('26', '飛龍', '30m', null, null, '1', '190756', '17', '33406', '32412', '0', '0', '33398', '32403', '33410', '32415', '5', '4', '1', '100', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('27', '飛龍', '30m', null, null, '1', '190756', '0', '33355', '32353', '0', '0', '33339', '32348', '33354', '32363', '5', '4', '1', '100', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('28', '飛龍', '30m', null, null, '1', '190756', '0', '33389', '32336', '0', '0', '33382', '32330', '33397', '32345', '5', '4', '1', '100', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('29', '飛龍', '30m', null, null, '1', '190756', '17', '33365', '32384', '0', '0', '33356', '32375', '33371', '32390', '5', '4', '1', '100', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('20', '曼波兔', '30m', null, null, '1', '45535', '21', '32799', '32839', '0', '0', '32723', '32787', '32875', '32892', '0', '430', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('31', '飛龍', '30m', null, null, '1', '190756', '0', '33385', '32349', '1', '1', '0', '0', '0', '0', '0', '4', '1', '100', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('32', '飛龍', '30m', null, null, '1', '190756', '0', '33271', '32394', '1', '1', '0', '0', '0', '0', '0', '4', '1', '100', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('36', '巴列斯', '1h', null, null, '1', '45583', '0', '32768', '32768', '0', '0', '32758', '32758', '32777', '32777', '0', '24', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('37', '巨大牛人', '10m', null, null, '1', '45584', '0', '32652', '32726', '0', '0', '32640', '32713', '32676', '32761', '0', '70', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('39', '死亡騎士(5~7F)', '1h', null, null, '1', '45601', '0', '32799', '32804', '0', '0', '32704', '32704', '32831', '32831', '0', '811', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('153', '巴拉卡斯', '2h', '2,4,6', null, '1', '45684', '0', '32725', '32800', '3', '3', '0', '0', '0', '0', '0', '67', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('43', '冰之女王侍女', '75m', null, null, '1', '45609', '0', '32767', '32900', '0', '0', '32763', '32886', '32783', '32910', '5', '74', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('45', '巨蟻女皇', null, '5,6', '21:00:00', '1', '97258', '0', '32923', '33278', '12', '12', '0', '0', '0', '0', '4', '4', '1', '0', '0', '2', '100');
INSERT INTO `spawnlist_boss` VALUES ('46', '不死鳥', '20m', null, null, '1', '45617', '0', '33723', '32255', '0', '0', '33718', '32240', '33725', '32268', '0', '4', '1', '100', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('49', '獨角獸', '30m', null, null, '3', '45640', '0', '32740', '32735', '0', '0', '32728', '32717', '32752', '32753', '4', '303', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('50', '土精靈王', '30m', null, null, '3', '45642', '0', '32727', '32749', '0', '0', '32685', '32701', '32770', '32798', '4', '303', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('51', '水精靈王', '30m', null, null, '3', '45643', '0', '32762', '32616', '0', '0', '32717', '32593', '32808', '32640', '4', '303', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('52', '風精靈王', '30m', null, null, '3', '45644', '0', '32624', '32807', '0', '0', '32588', '32739', '32660', '32876', '4', '303', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('53', '火精靈王', '30m', null, null, '3', '45645', '0', '32833', '32778', '0', '0', '32798', '32738', '32869', '32818', '4', '303', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('54', '深淵之主', '30m', null, null, '1', '45646', '22', '32824', '32815', '0', '0', '32704', '32768', '32959', '33023', '0', '430', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('57', '魔獸軍王‧巴蘭卡', '30m', null, null, '1', '45651', '19', '32915', '32896', '0', '0', '32964', '32881', '32998', '32915', '0', '320', '0', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('61', '阿利歐克', '30m', null, null, '1', '45671', '0', '32681', '32947', '0', '0', '32678', '32937', '32692', '32948', '5', '243', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('68', '反王肯恩', '1h', null, null, '1', '45680', '18', '34092', '33262', '0', '0', '34079', '33250', '34100', '33271', '0', '4', '0', '100', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('150', '法利昂', '2h', '1,3,5,0', null, '1', '45683', '0', '32771', '32831', '3', '3', '0', '0', '0', '0', '0', '65', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('151', '林德拜爾', '2h', '1,3,5,0', null, '1', '45681', '0', '34266', '32793', '3', '3', '0', '0', '0', '0', '0', '4', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('73', '墮落', '10m', null, null, '1', '45685', '0', '32904', '32801', '0', '0', '32889', '32788', '32916', '32810', '0', '410', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('74', '高麗幼犬', '10m', null, null, '1', '45711', '0', '32511', '33024', '0', '0', '32276', '32785', '32746', '33263', '0', '440', '0', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('75', '高麗幼犬', '10m', null, null, '1', '45711', '0', '32767', '32899', '0', '0', '32660', '32791', '32875', '33007', '0', '480', '0', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('76', '高麗幼犬', '10m', null, null, '1', '45711', '0', '32796', '32863', '0', '0', '32629', '32692', '32964', '32978', '0', '70', '0', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('77', '高麗幼犬', '10m', null, null, '1', '45711', '0', '32671', '32862', '0', '0', '32527', '32718', '32815', '33007', '0', '69', '0', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('79', '高麗幼犬', '10m', null, null, '1', '45711', '0', '32804', '32734', '0', '0', '32654', '32591', '32955', '32878', '0', '68', '0', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('80', '高麗幼犬', '10m', null, null, '5', '45711', '0', '33408', '32834', '0', '0', '32528', '32200', '34288', '33519', '0', '4', '0', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('81', '大王烏賊', '10m', null, null, '1', '45734', '0', '32781', '32799', '0', '0', '32704', '32768', '33215', '33279', '0', '558', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('82', '半魚人首領', '10m', null, null, '1', '45735', '0', '32781', '32799', '0', '0', '32704', '32768', '33215', '33279', '0', '558', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('83', '炎魔', '10m', null, null, '1', '45752', '0', '32726', '32832', '0', '0', '0', '0', '0', '0', '0', '603', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('84', '污濁妖魔戰士', '10m', null, null, '1', '45772', '0', '32729', '32792', '0', '0', '32729', '32792', '32809', '32930', '5', '244', '1', '100', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('85', '樹精', '10m', null, null, '1', '45795', '0', '32841', '32913', '0', '0', '32841', '32913', '32880', '32947', '5', '244', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('86', '瑪依奴夏門的鑽石高崙', '10m', null, null, '1', '45801', '0', '32778', '32797', '0', '0', '0', '0', '0', '0', '5', '255', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('87', '瑪依奴夏門', '10m', null, null, '1', '45802', '0', '32696', '32793', '0', '0', '32640', '32768', '32895', '33023', '5', '256', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('88', '巴貝多', '10m', null, null, '1', '45829', '0', '32675', '32860', '0', '0', '0', '0', '0', '0', '0', '254', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('91', '豪勢', '10m', null, null, '1', '45548', '0', '32775', '32849', '0', '0', '32710', '32770', '32830', '32895', '5', '484', '0', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('92', '暗殺團長‧布雷哲', '30m', null, null, '1', '45585', '0', '32785', '32837', '0', '0', '0', '0', '0', '0', '5', '495', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('93', '親衛隊長‧凱特', '30m', null, null, '1', '45574', '0', '32831', '32762', '0', '0', '0', '0', '0', '0', '5', '494', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('94', '暗殺軍王‧史雷佛', '30m', '0,6', null, '1', '45648', '0', '32853', '32863', '0', '0', '0', '0', '0', '0', '5', '492', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('95', '突擊旅長‧闇黑劍士', '30m', null, null, '1', '45577', '0', '32783', '32837', '0', '0', '0', '0', '0', '0', '5', '452', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('96', '魔獸軍王‧巴蘭卡', '30m', '0,6', null, '1', '45844', '0', '32838', '32758', '0', '0', '0', '0', '0', '0', '5', '453', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('97', '魔獸師長‧辛克萊', '30m', null, null, '1', '45588', '0', '32745', '32823', '0', '0', '0', '0', '0', '0', '5', '456', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('98', '魔獸團長‧凱巴勒', '30m', null, null, '1', '45607', '0', '32758', '32823', '0', '0', '0', '0', '0', '0', '5', '455', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('99', '神官長‧邦妮', '30m', null, null, '1', '45612', '0', '32770', '32829', '0', '0', '0', '0', '0', '0', '5', '466', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('100', '魔法團長‧卡勒米爾', '30m', null, null, '1', '45602', '0', '32842', '32821', '0', '0', '0', '0', '0', '0', '5', '461', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('101', '法令軍王‧蕾雅', '30m', '0,6', null, '1', '45863', '0', '32805', '32839', '0', '0', '0', '0', '0', '0', '5', '462', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('102', '傭兵隊長‧麥帕斯托', '30m', null, null, '1', '45608', '0', '32791', '32815', '0', '0', '0', '0', '0', '0', '5', '471', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('103', '冥法團長‧可利波斯', '30m', null, null, '1', '45615', '0', '32922', '32846', '0', '0', '0', '0', '0', '0', '5', '473', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('104', '冥法軍王‧海露拜', '30m', '0,6', null, '1', '45676', '0', '32785', '32844', '0', '0', '0', '0', '0', '0', '5', '475', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('105', '伯爵的親衛隊', '10m', null, null, '1', '46024', '51', '32737', '32827', '0', '0', '0', '0', '0', '0', '5', '250', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('106', '塔洛斯伯爵', '10m', null, null, '1', '46025', '0', '32809', '32796', '0', '0', '0', '0', '0', '0', '5', '251', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('107', '曼孟', '10m', null, null, '1', '46026', '0', '32797', '32790', '0', '0', '0', '0', '0', '0', '5', '251', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('108', '瑪雅', '10m', null, null, '1', '46037', '0', '32796', '33072', '0', '0', '0', '0', '0', '0', '6', '258', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('122', '長老‧巴陸德(8長老輪流npcid勿改)', '1m', '6', null, '1', '97370', '0', '32837', '32769', '40', '40', '0', '0', '0', '0', '5', '479', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('123', '副神官‧卡山德拉', '10m', null, null, '1', '45963', '0', '32858', '32821', '0', '0', '0', '0', '0', '0', '5', '534', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('124', '底比斯 阿努比斯', '10m', null, null, '1', '46124', '0', '32782', '32827', '0', '0', '0', '0', '0', '0', '6', '782', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('125', '底比斯 賀洛斯', '10m', null, null, '1', '46123', '0', '32782', '32836', '0', '0', '0', '0', '0', '0', '6', '782', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('126', '冰之女王', '10m', null, null, '1', '46141', '0', '32842', '32921', '0', '0', '0', '0', '0', '0', '5', '74', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('127', '冰魔', '10m', null, null, '1', '46142', '0', '32753', '32776', '10', '10', '0', '0', '0', '0', '5', '73', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('152', '安塔瑞斯', '2h', '2,4,6', null, '1', '45682', '0', '32698', '32824', '3', '3', '0', '0', '0', '0', '0', '37', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('129', '卡士柏(四色)', '30m', null, null, '1', '45488', '14', '32762', '32768', '0', '0', '32704', '32704', '32831', '32831', '0', '809', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('131', '巨型骷髏', null, '3,4', '15:20:18', '1', '190026', '0', '32995', '32762', '0', '0', '0', '0', '0', '0', '4', '8003', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('132', '巨型骷髏', null, '3', '20:01:18', '1', '190026', '0', '32995', '32762', '0', '0', '0', '0', '0', '0', '4', '8002', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('133', '巨型骷髏', null, '3', '20:01:18', '1', '190026', '0', '32995', '32762', '0', '0', '0', '0', '0', '0', '0', '8001', '1', '0', '0', '0', '100');
INSERT INTO `spawnlist_boss` VALUES ('134', '沙蟲', null, '5,6', '21:00:00', '1', '190086', '0', '32773', '33145', '5', '5', '0', '0', '0', '0', '5', '4', '1', '0', '0', '2', '100');
INSERT INTO `spawnlist_boss` VALUES ('162', '至尊亞力安', '', '0,1,2,3,4,5,6,', '22:00:00', '1', '190882', '0', '32867', '32799', '250', '250', '32742', '32674', '32992', '32924', '5', '631', '1', '0', '0', '0', '100');

-- ----------------------------
-- Table structure for `spawnlist_door`
-- ----------------------------
DROP TABLE IF EXISTS `spawnlist_door`;
